Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Also, a value of Zero does not set mute status.
fr: En outre, une valeur de zéro ne définit pas le statut muet.

source: On Windows Vista, there is no system-wide wave volume.
fr: Sous Windows Vista, il n'y a pas de volume du son du système.

source: This function only changes the wave volume for the script.
fr: Cette fonction change seulement le volume du son pour le script.

source: It can not be used to change the wave volume of other programs.
fr: Elle ne peut pas être utilisée pour modifier le volume du son d'autres programmes.

source: Set the volume to 50%.
fr: Règle le volume à 50 %.

source: Title for splash window.
fr: Titre de la fenêtre.

source: full path\filename of image (BMP, GIF, or JPG)
fr: Chemin d'accès complet\nom du fichier image (BMP, GIF, ou JPG)

source: width of window in pixels.
fr: largeur de la fenêtre en pixels.

source: (default is 500)
fr: (500 par défaut)

source: height of window in pixels.
fr: hauteur de la fenêtre en pixels.

source: (default is 400)
fr: (400 par défaut)

source: position from left (in pixels) of splash window.
fr: position de la fenêtre splash à partir de la gauche (en pixels).

source: (default is centered)
fr: (centré par défaut)

source: position from top (in pixels) of splash window.
fr: position de la fenêtre splash à partir du haut (en pixels).

source: To skip an optional parameter, leaving its default value intact, use a value of -1.
fr: Pour sauter un paramètre optionnel, en laissant sa valeur par défaut intacte, utilisez la valeur -1.

source: The image is scaled to specified width and height and should be a Bitmap, GIF, or JPEG image.
fr: L'image est redimensionnée à la largeur et la hauteur spécifiée et devrait être une image Bitmap, GIF ou JPEG.

source: Icons (ICOs) will not display, though the window still appears.
fr: Les icônes (ICO) ne seront pas affichés, malgré l'apparition de la fenêtre.

source: PNG images throw an error message of failing to load, and so do invalid files/paths.
fr: Les images PNG provoquent un message d'erreur de chargement, tout comme les fichiers/chemins invalides.

source: Images are not embedded in the executable unless you use FileInstall()
fr: Les images ne sont pas incorporées dans l'exécutable à moins que vous n'utilisiez FileInstall().

source: Only one SplashImage/Text window is allowed at one time; so if you wish to cycle through multiple images/text, simply call SplashImageOn()/SplashTextOn() again with the new information.
fr: Une seule fenêtre splashImage/splashtext est permise en même temps, donc si vous souhaitez faire défiler plusieurs images/textes, utilisez simplement SplashImageOn()/SplashTextOn() de nouveau avec les nouvelles informations.

source: Splash with opt=1 cannot be moved and cannot be activated by click.
fr: Un splash avec opt=1 ne peut être déplacé et ne peut pas être activé par un clic.

source: Text for splash window.
fr: Texte de la fenêtre splash.

source: Width of window in pixels.
fr: Largeur de la fenêtre en pixels.

source: (default 500)
fr: (500 par défaut)

source: Height of window in pixels.
fr: Hauteur de la fenêtre en pixels.

source: (default 400)
fr: (400 par défaut)

source: Position from left (in pixels) of splash window.
fr: Position de la fenêtre splash à partir de la gauche (en pixels).

source: Position from top (in pixels) of splash window.
fr: Position de la fenêtre splash à partir du haut (en pixels).

source: Add them up - default is 'center justified/always on top/with title'
fr: Ajoutez les options - par défaut c'est 'centrée justifiée/toujours au premier plan/avec titre".

source: 0 = Center justified/always on top/with title (default)
fr: 0 = Justifiée centrée/toujours au premier plan/avec titre (par défaut)

source: $DLG_NOTITLE (1) = Thin bordered titleless window
fr: $DLG_NOTITLE (1) = Fenêtre sans titre à bordure mince

source: $DLG_TEXTLEFT (4) = Left justified text
fr: $DLG_TEXTLEFT (4) = texte justifié à gauche

source: $DLG_TEXTRIGHT (8) = Right justified text
fr: $DLG_TEXTRIGHT (8) = texte justifié à droite

source: $DLG_MOVEABLE (16) = Windows can be moved
fr: $DLG_TEXTVCENTER (16) = La fenêtre peut être déplacée

source: $DLG_TEXTVCENTER (32) = Center text vertically
fr: $DLG_TEXTVCENTER (32) = Centrer le texte verticalement

source: (OS default GUI font is used if the font is "" or is not found)
fr: (La police GUI par défaut dans l'OS est utilisée si la police est "" ou si elle n'est pas trouvée)

source: Font size.
fr: Taille de la police.

source: (default is 12; standard sizes are 6 8 9 10 11 12 14 16 18 20 22 24 26 28 36 48 72)
fr: (12 par défaut; les tailles standard sont 6 8 9 10 11 12 14 16 18 20 22 24 26 28 36 48 72)

source: The weight of the font in the range 0 through 1000.
fr: La graisse de la police de 0 à 1000.

source: For example, 400 is normal and 700 is bold.
fr: Par exemple, 400 est normal et 700 est gras.

source: Return the Handle of the splash window that can be used in ControlSetText().
fr: Retourne le handle de la fenêtre splash qui peut être utilisé dans ControlSetText().

source: Even better is to use ControlSetText() to update text without flicker...
fr: Il est préférable d'utiliser ControlSetText() pour mettre à jour le texte sans faire flasher la fenêtre.

source: If the text is center and multiline, the ControlSetText() will not override the number of lines created by the SplashTextOn().
fr: Si le texte est centré et multi-lignes, le ControlSetText() ne modifiera pas le nombre de lignes créées par le SplashTextOn().

source: Standard font names include:
fr: Noms de polices standard incluses:

source: Arial, Comic Sans MS, Courier New, Lucida Console, Microsoft Sans Serif, System, Tahoma, Times New Roman, and WingDings
fr: Arial, Comic Sans MS, Courier New, Lucida Console, Microsoft Sans Serif, système, Tahoma, Times New Roman, et WingDings

source: Use @LF to display several lines.
fr: Utilisez @LF pour afficher plusieurs lignes.

source: ; SMOOTH
fr: ; LISSE

source: SQLite user defined functions Reference
fr: SQLite - Référence

source: When using them you need to add a #include <SQLite.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <SQLite.au3>.

source: Calculates the square-root of a number.
fr: Calcule la racine carrée d'un nombre.

source: Any nonnegative expression to get the square-root of.
fr: Toute expression positive ou nulle dont on veut obtenir la racine carrée.

source: the square-root.
fr: Retourne la racine carrée.

source: -1.#IND if parameter is negative.
fr: Retourne -1.#IND si le paramètre est strictement négatif.

source: To compute an nth root, use the power operator: x ^ (1/n)
fr: Pour calculer une racine n-ième, utilisez l'opérateur de puissance: x ^ (1/n)

source: MsgBox(4096,"The cube root of 27 is", 27 ^ (1/3) )
fr: MsgBox(4096, "La racine cubique de 27 est ", 27 ^ (1 / 3))

source: Assign a Local variable the square-root of 2.
fr: Assigne une variable locale avec la racine carrée de 2.

source: Assign a Local variable the square-root of 9.
fr: Assigne une variable locale avec la racine carrée de 9.

source: Set Seed for random number generation.
fr: Définit la valeur de départ pour le générateur de nombre aléatoire.

source: Seed value for random number generation.
fr: Valeur de départ pour le générateur de nombre aléatoire.

source: Number between -2^31 and 2^31-1
fr: Nombre compris entre -2^31 et 2^31-1.

source: When using SRandom() sequence of random numbers will be repeated each time you run the script.
fr: Lors de l'utilisation de SRandom() une séquence de nombres aléatoires sera répétée chaque fois que vous exécutez le script.

source: For example, you can test the speed of the script and the random numbers will not affect the test results.
fr: Par exemple, vous pouvez tester la vitesse du script et les nombres aléatoires n'affecteront pas les résultats du test.

source: After each call to SRandom() random number generator starts a new sequence.
fr: Après chaque appel de SRandom() le générateur de nombre aléatoire démarre une nouvelle séquence.

source: Use the SRandom(@SEC), for random sequences.
fr: Utilisez SRandom(@SEC), pour des séquences aléatoires.

source: Sets the seed to the number 12.
fr: Définit la valeur de départ à 12.

source: Assign a Local variable the random number based on the above seed.
fr: Assigne une variable locale du nombre aléatoire basé sur la valeur ci-dessus.

source: You will get the same result each time as the seed is constant.
fr: Vous obtiendrez le même résultat à chaque fois que la valeur d départ est la même.

source: The title/hWnd/class of the window to check.
fr: Le titre/hWnd/classe de la fenêtre à traiter.

source: The text of the window to check.
fr: Le texte de la fenêtre à traiter.

source: Default is an empty string.
fr: Par défaut est une chaîne vide.

source: The "part" number of the status bar to read - the default is 1.
fr: Le numéro de la "partie" de la barre d'état à lire - la valeur par défaut est 1.

source: 1 is the first possible part and usually the one that contains the useful messages like "Ready" "Loading...", etc.
fr: C'est la première partie possible et le plus souvent celle qui contient les messages utiles comme "Ready ", "Loading", etc...

source: the text read.
fr: Retourne le texte lu.

source: "" (empty string) and sets the @error flag to 1 if no text could be read.
fr: Retourne "" (Chaîne vide ) et @error = 1 si aucun texte n'a pu être lu.

source: This functions attempts to read the first standard status bar on a window (Microsoft common control: msctls_statusbar32).
fr: Cette fonction tente de lire la première partie d'une barre d'état standard dans une fenêtre (contrôle commun Microsoft: msctls_statusbar32 ).

source: Some programs use their own status bars or special versions of the MS common control which StatusbarGetText() cannot read.
fr: Certains programmes utilisent leurs propres barres d'état ou des versions spéciales du contrôle commun MS que StatusbarGetText() ne peut pas lire.

source: For example, StatusbarGetText does not work on the program TextPad; however, the first region of TextPad's status bar can be read using ControlGetText("TextPad", "", "HSStatusBar1")
fr: Par exemple, StatusbarGetText ne fonctionne pas avec le programme TextPad; cependant la première région de la barre d'état de TextPad peut être lue en utilisant ControlGetText("TextPad ", "", "HSStatusBar1")

source: StatusbarGetText() can work on windows that are minimized or even hidden.
fr: StatusbarGetText() peut travailler sur les fenêtres qui sont minimisées ou même cachées.

source: Reads from the STDERR stream of a previously run child process.
fr: Lit dans le flux STDERR d'un processus enfant lancé au préalable.

source: The process ID of a child process, as returned by a previous call to Run.
fr: L'ID de processus d'un processus enfant, tel que retourné par un appel précédent à Run.

source: sets the @error flag to non-zero if EOF is reached, STDERR was not redirected for the process or other error.
fr: Retourne @error <> 0 si EOF est atteint, STDERR n'a pas été redirigé pour le processus ou une autre erreur.

source: StderrRead() reads from the console standard output stream of a child process, which is normally used by console applications to write to the screen.
fr: StderrRead() lit à partir du flux de sortie standard de la console du processus enfant, qui est normalement utilisé par les applications console pour écrire sur l'écran.

source: During the call to Run() for the child process you wish to read from the STD I/O parameter must have included the value of $STDERR_CHILD (4) for this function to work properly (see the Run() function).
fr: Durant l'appel de Run() pour le processus enfant, si vous souhaitez lire à partir du STD I/O, le paramètre doit avoir pris en compte la valeur $STDERR_CHILD (4) sinon cette fonction ne tavaillera pas correctement (voir la fonction Run()).

source: StderrRead() does not block, it will return immediately.
fr: StderrRead() ne bloque pas, il retournera immédiatement.

source: Exit the loop if the process closes or StdoutRead returns an error.
fr: Sort de la boucle si le processus ferme ou si StdoutRead renvoie une erreur.

source: Exit the loop if the process closes or StderrRead returns an error.
fr: Sort de la boucle si le processus ferme ou si StderrRead renvoie une erreur.

source: Writes a number of characters to the STDIN stream of a previously run child process.
fr: Ecrit un nombre de caractères dans le flux STDIN d'un processus enfant lancé au préalable.

source: the number of characters written.
fr: Retourne le nombre de caractères écrits.

source: sets the @error flag to non-zero if STDIN was not redirected for the process or other error.
fr: Retourne @error <> 0 si STDIN n'a pas été redirigé pour le processus ou autre erreur.

source: StdinWrite() writes to the console standard input stream for a child process, which is normally used by console applications to read input from the user i.e. from the keyboard.
fr: StdinWrite() écrit dans le flux d'entée standard de la console pour un processus enfant, qui est normalement utilisé par les applications console pour lire des entrées de l'utilisateur, par exemple le clavier.

source: During the call to Run() for the child process you wish to write to the STD I/O parameter must have included the value of $STDIN_CHILD (1) for this function to work properly (see the Run() function).
fr: Pendant l'appel de Run() pour le processus enfant, pour écrire dans le STD I/O, le paramètre doit avoir inclus la valeur $STDIN_CHILD (1) pour que cette fonction travaille correctement (voir la fonction Run()).

source: The optional second parameter is the string that you wish StdinWrite() to write to the stream.
fr: Le second paramètre optionnel est la chaîne que vous souhaitez StdinWrite(), écrire dans le flux.

source: If the function is called with no second argument, StdinWrite() closes the stream and invalidates it for further writing.
fr: Si la fonction est appelée sans le second paramètre, StdinWrite() ferme le flux et l'invalide pour l'écriture.

source: The stream is a first-in first-out buffer with an arbitrary limited size; if at any time when this function is called (unless it's being called to close the stream) there is no room for more characters to be written to the stream, the StdinWrite() function will block (pause) and not return until the child process closes the stream or reads enough characters from the stream to permit the write procedure to complete.
fr: Le flux est un buffer 'first-in/first-out', premier entré premier sorti, avec une taille limitée arbitraire; si, à un moment où cette fonction est appelée (sauf si elle est appelée à fermer le flux) il n'y a pas de place pour plus de caractères à écrire dans le flux, la fonction StdinWrite() permet de bloquer (pause) et de ne pas retourner jusqu'à ce que le processus enfant ferme le flux ou lit assez de caractères dans le flux pour permettre à la procédure d'écriture de terminer.

source: This means that the AutoIt process will be halted, and there will be no processing of hotkeys, GUI messages, etc.
fr: Cela signifie que le processus AutoIt sera arrêté, et il n'y aura pas de traitement de raccourcis clavier, ni des messages de la GUI, etc...

source: until the child process reads from the STDIN stream.
fr: jusqu'à ce que le processus enfant lise le flux STDIN.

source: Write a string of items to be sorted to child sort.exe's Stdin.
fr: Ecrit une chaîne d'éléments à trier dans Stdin de sort.exe de l'enfant.

source: Calling StdinWrite without a second parameter closes the stream.
fr: Appel de StdinWrite sans second paramètre ferme le flux.

source: Store the output of StdoutRead to a variable.
fr: Stocke la sortie de StdoutRead dans une variable.

source: Read the Stdout stream of the PID returned by Run.
fr: Lit le flux Stdout du PID renvoyée par Run.

source: Closes all resources associated with a process previously run with STDIO redirection.
fr: Ferme toutes les ressources associées à un processus lancé précédemment avec la redirection STDIO.

source: 0 if the process did not have STDIO redirection or was already closed.
fr: Retourne 0 si le processus n'a pas eu de redirection STDIO ou était déjà fermé.

source: This function closes all handles and releases all resources related to STDIO.
fr: Cette fonction ferme toutes les handles et libère toutes les ressources relatives à STDIO.

source: It will no longer be possible to read the STDIO data from the process.
fr: Il ne sera plus possible de lire les données de STDIO du processus.

source: Any pending data will be lost.
fr: Toutes les données en attente seront perdues.

source: Required for _ArrayDisplay only.
fr: Requis pour _ArrayDisplay seulement.

source: Recursively display a list of files in a directory.
fr: Affiche de manière récursive une liste de fichiers dans un répertoire.

source: Search the current script directory.
fr: Recherche dans le répertoire du script en cours.

source: Search for all files in the current directory.
fr: Recherche tous les fichiers dans le répertoire courant.

source: For a list of valid wildcards, search for 'Wildcards' in the Help file.
fr: Pour une liste des caractères génériques valides, recherchez 'caractères génériques' dans le fichier d'aide.

source: If the file path isn't a directory then return from the 'Example' function.
fr: Si le chemin du fichier n'est pas un répertoire alors Return de la fonction 'Exemple'.

source: Remove trailing backslashes and append a single trailing backslash.
fr: Enlève les antislashs arrière et ajouter une simple barre oblique inverse.

source: Close the Stdio stream of the PID returned by Run.
fr: Ferme le flux Stdio du PID renvoyée par Run.

source: This will cause the message box to display due to not being able to read the stdout stream.
fr: Cela entraînera que la boîte de message ne sera pas capable de lire le flux de sortie standard.

source: Use StringSplit to split the output of StdoutRead to an array.
fr: Utilise StringSplit pour partager la sortie de StdoutRead en un tableau.

source: All carriage returns (@CRLF) are stripped and @CRLF (line feed) is used as the delimiter.
fr: Tous les retours chariot (@CRLF) sont supprimés et @CRLF (saut de ligne) est utilisé comme séparateur.

source: Reads from the STDOUT stream of a previously run child process.
fr: Lit dans le flux STDOUT d'un processus enfant lancé au préalable.

source: sets the @error flag to non-zero if EOF is reached, STDOUT was not redirected for the process or other error.
fr: Retourne @error <> 0 si EOF est atteint, STDOUT n'a pas été redirigé pour le processus ou autre erreur.

source: StdoutRead() reads from the console standard output stream of a child process, which is normally used by console applications to write to the screen.
fr: StdoutRead() lit à partir du flux de sortie standard de la console du processus enfant, qui est normalement utilisé par les applications console pour écrire sur l'écran.

source: During the call to Run() for the child process you wish to read from the STD I/O parameter must have included the value of $STDOUT_CHILD (2) for this function to work properly (see the Run() function).
fr: Pendant l'appel de Run() pour le processus enfant, pour lire à partir de STD I/O, le paramètre doit avoir inclus la valeur $STDOUT_CHILD (2) pour que cette fonction travaille correctement (voir la fonction Run()).

source: StdoutRead() does not block, it will return immediately.
fr: La fonction StdoutRead() ne bloque pas, elle retournera immédiatement.

source: If you want to search with files that contains unicode characters, then use the /U commandline parameter.
fr: Si vous souhaitez rechercher des fichiers contenant des caractères Unicode, alors utilisez le paramètre de ligne de commande /U.

source: Wait until the process has closed using the PID returned by Run.
fr: Attend que le processus ait fermé en utilisant le PID renvoyé par Run.

source: This can also be done in a while loop.
fr: Ceci peut également être fait dans une boucle while.

source: Look at the example for StderrRead.
fr: Regardez l'exemple de StderrRead.

source: String user defined functions Reference
fr: String - Référence

source: When using them you need to add a #include <String.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <String.au3>.

source: Returns the string representation of an expression.
fr: Retourne la représentation chaîne d'une expression.

source: Returns a string.
fr: Retourne une chaîne.

source: Maximum string length is 2147483647 characters (but keep in mind that no line in an AutoIt script can exceed 4095 characters.)
fr: La longueur maximum d'une chaîne est 2 147 483 647 caractères (notez qu'aucune ligne ne peut dépasser 4095 caractères dans un script AutoIt.)

source: The expression passed to String will return a string representation, currently 10 is a number.
fr: L'expression passée à String renverra une représentation de chaîne, ici "10".

source: Takes a string and prefixes all linefeed characters ( Chr(10) ) with a carriage return character ( Chr(13) ).
fr: Ajoute @CR devant tous les caractèrs @LF d'une chaîne.

source: The string to convert.
fr: La chaîne à convertir.

source: Returns the string with all instances of linefeed characters ( @LF ) prefixed with a carriage return character ( @CR ).
fr: Retourne la chaîne avec toutes les instances des caractères saut de ligne (@LF) préfixées par un caractère de retour chariot (@CR).

source: Add the carriage return charcter to all the line feed characters in the string.
fr: Ajoute le caractère 'retour chariot' à tous les caractères 'ligne suivante' dans la chaîne.

source: Compares two strings with options.
fr: Compare deux chaînes avec, ou pas, sensibilité à la casse.

source: The first string to evaluate.
fr: La première chaîne.

source: The second string to evaluate.
fr: La seconde chaîne à comparer à la premère.

source: $STR_NOCASESENSE (0) = not case sensitive, using the user's locale (default)
fr: $STR_NOCASESENSE (0) = insensible à la casse, utilise les paramètres locaux de l'utilisateur (par défaut)

source: $STR_CASESENSE (1) = case sensitive
fr: $STR_CASESENSE (1) = sensible à la casse

source: $STR_NOCASESENSEBASIC (2) = not case sensitive, using a basic/faster comparison
fr: $STR_NOCASESENSEBASIC (2) = insensible à la casse, utilise une comparaison simple/rapide

source: Constants are defined in StringConstants.au3
fr: Les constantes sont définies dans StringConstants

source: string1 and string2 are equal
fr: string1 et string2 sont égales

source: string1 is greater than string2
fr: string1 est supérieure à string2

source: string1 is less than string2
fr: string1 est inférieure à string2

source: Compare two strings without using case sensitivity.
fr: Compare deux chaînes sans utiliser la casse.

source: Compare two strings with using case sensitivity.
fr: Compare deux chaînes avec sensibilité à la casse.

source: Returns a formatted string (similar to the C sprintf() function).
fr: Retourne une chaîne formatée (similaire à sprintf() en C).

source: The format and flags to use (see Remarks).
fr: Le format et les drapeaux à utiliser (Voir Remarques).

source: Up to 32 variables that will be output according to the "format control".
fr: Jusqu'à 32 variables qui seront affichées selon le paramètre "format control".

source: Returns the formatted string according to "format control" parameter.
fr: Retourne la chaîne formatée selon le paramètre "format control".

source: To prevent buffer overflow, each "variable" is limited to 65535 characters.
fr: Pour éviter le débordement de la mémoire tampon, chaque "variable" est limitée à 65535 caractères.
